app/controllers/ticket_requests_controller.rb

INSERT INTO "ticket_requests" ("destination", "flight_number", "departure_date", "applicant_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @ticket_request = TicketRequest.new(ticket_request_params)
    if @ticket_request.save

SELECT "ticket_requests".* FROM "ticket_requests"
---
  def index
    @ticket_requests = TicketRequest.all

SELECT "ticket_requests".* FROM "ticket_requests" WHERE "ticket_requests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "ticket_requests" WHERE "ticket_requests"."id" = ?  [["id", 2]]
---
  def destroy
    @ticket_request = TicketRequest.find(params[:id])
    @ticket_request.destroy